Revit 2027 API
BuiltInFailures.DimensionFailures.UnavailableDimensionHostReference Property
 A dimension reference could not be resolved on the host element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnavailableDimensionHostReference { get; }
Public Shared ReadOnly Property UnavailableDimensionHostReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnavailableDimensionHostReference {
	FailureDefinitionId^ get ();
}
static member UnavailableDimensionHostReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace